entropia/gpn17-badge/arduino/gpnbadge-2.3.0/boards.txt
coredev.menu.LwIPVariant.Espressif=Espressif (xcc)
coredev.menu.LwIPVariant.Espressif.build.lwip_lib=-llwip
coredev.menu.LwIPVariant.Espressif.build.lwip_flags=
coredev.menu.LwIPVariant.Prebuilt=Prebuilt Source (gcc)
coredev.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
coredev.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
coredev.menu.LwIPVariant.OpenSource=Open Source (gcc)
coredev.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
coredev.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
coredev.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"

coredev.menu.CpuFrequency.80=80 MHz
coredev.menu.CpuFrequency.80.build.f_cpu=80000000L
coredev.menu.CpuFrequency.160=160 MHz
coredev.menu.CpuFrequency.160.build.f_cpu=160000000L

coredev.menu.FlashFreq.40=40MHz
coredev.menu.FlashFreq.40.build.flash_freq=40
coredev.menu.FlashFreq.80=80MHz
coredev.menu.FlashFreq.80.build.flash_freq=80

coredev.menu.FlashMode.dio=DIO
coredev.menu.FlashMode.dio.build.flash_mode=dio
coredev.menu.FlashMode.qio=QIO
coredev.menu.FlashMode.qio.build.flash_mode=qio
coredev.menu.FlashMode.dout=DOUT
coredev.menu.FlashMode.dout.build.flash_mode=dout
coredev.menu.FlashMode.qout=QOUT
coredev.menu.FlashMode.qout.build.flash_mode=qout

coredev.menu.UploadSpeed.115200=115200
coredev.menu.UploadSpeed.115200.upload.speed=115200
coredev.menu.UploadSpeed.9600=9600
coredev.menu.UploadSpeed.9600.upload.speed=9600
coredev.menu.UploadSpeed.57600=57600
coredev.menu.UploadSpeed.57600.upload.speed=57600
coredev.menu.UploadSpeed.256000.windows=256000
coredev.menu.UploadSpeed.256000.upload.speed=256000
coredev.menu.UploadSpeed.230400.linux=230400
coredev.menu.UploadSpeed.230400.macosx=230400
coredev.menu.UploadSpeed.230400.upload.speed=230400
coredev.menu.UploadSpeed.460800.linux=460800
coredev.menu.UploadSpeed.460800.macosx=460800
coredev.menu.UploadSpeed.460800.upload.speed=460800
coredev.menu.UploadSpeed.512000.windows=512000
coredev.menu.UploadSpeed.512000.upload.speed=512000
coredev.menu.UploadSpeed.921600=921600
coredev.menu.UploadSpeed.921600.upload.speed=921600

coredev.menu.FlashSize.512K64=512K (64K SPIFFS)
coredev.menu.FlashSize.512K64.build.flash_size=512K
coredev.menu.FlashSize.512K64.build.flash_ld=eagle.flash.512k64.ld
coredev.menu.FlashSize.512K64.build.spiffs_start=0x6B000
coredev.menu.FlashSize.512K64.build.spiffs_end=0x7B000
coredev.menu.FlashSize.512K64.build.spiffs_blocksize=4096
coredev.menu.FlashSize.512K64.upload.maximum_size=434160

coredev.menu.FlashSize.512K128=512K (128K SPIFFS)
coredev.menu.FlashSize.512K128.build.flash_size=512K
coredev.menu.FlashSize.512K128.build.flash_ld=eagle.flash.512k128.ld
coredev.menu.FlashSize.512K128.build.spiffs_start=0x5B000
coredev.menu.FlashSize.512K128.build.spiffs_end=0x7B000
coredev.menu.FlashSize.512K128.build.spiffs_blocksize=4096
coredev.menu.FlashSize.512K128.upload.maximum_size=368624

coredev.menu.FlashSize.512K0=512K (no SPIFFS)
coredev.menu.FlashSize.512K0.build.flash_size=512K
coredev.menu.FlashSize.512K0.build.flash_ld=eagle.flash.512k0.ld
coredev.menu.FlashSize.512K0.upload.maximum_size=499696

coredev.menu.FlashSize.1M512=1M (512K SPIFFS)
coredev.menu.FlashSize.1M512.build.flash_size=1M
coredev.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
coredev.menu.FlashSize.1M512.build.spiffs_start=0x7B000
coredev.menu.FlashSize.1M512.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M512.build.spiffs_blocksize=8192
coredev.menu.FlashSize.1M512.upload.maximum_size=499696

coredev.menu.FlashSize.1M256=1M (256K SPIFFS)
coredev.menu.FlashSize.1M256.build.flash_size=1M
coredev.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
coredev.menu.FlashSize.1M256.build.spiffs_start=0xBB000
coredev.menu.FlashSize.1M256.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M256.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M256.upload.maximum_size=761840

coredev.menu.FlashSize.1M192=1M (192K SPIFFS)
coredev.menu.FlashSize.1M192.build.flash_size=1M
coredev.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
coredev.menu.FlashSize.1M192.build.spiffs_start=0xCB000
coredev.menu.FlashSize.1M192.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M192.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M192.upload.maximum_size=827376

coredev.menu.FlashSize.1M160=1M (160K SPIFFS)
coredev.menu.FlashSize.1M160.build.flash_size=1M
coredev.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
coredev.menu.FlashSize.1M160.build.spiffs_start=0xD3000
coredev.menu.FlashSize.1M160.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M160.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M160.upload.maximum_size=860144

coredev.menu.FlashSize.1M144=1M (144K SPIFFS)
coredev.menu.FlashSize.1M144.build.flash_size=1M
coredev.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
coredev.menu.FlashSize.1M144.build.spiffs_start=0xD7000
coredev.menu.FlashSize.1M144.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M144.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M144.upload.maximum_size=876528

coredev.menu.FlashSize.1M128=1M (128K SPIFFS)
coredev.menu.FlashSize.1M128.build.flash_size=1M
coredev.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
coredev.menu.FlashSize.1M128.build.spiffs_start=0xDB000
coredev.menu.FlashSize.1M128.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M128.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M128.upload.maximum_size=892912

coredev.menu.FlashSize.1M64=1M (64K SPIFFS)
coredev.menu.FlashSize.1M64.build.flash_size=1M
coredev.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
coredev.menu.FlashSize.1M64.build.spiffs_start=0xEB000
coredev.menu.FlashSize.1M64.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M64.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M64.upload.maximum_size=958448

coredev.menu.FlashSize.2M=2M (1M SPIFFS)
coredev.menu.FlashSize.2M.build.flash_size=2M
coredev.menu.FlashSize.2M.build.flash_ld=eagle.flash.2m.ld
coredev.menu.FlashSize.2M.build.spiffs_start=0x100000
coredev.menu.FlashSize.2M.build.spiffs_end=0x1FB000
coredev.menu.FlashSize.2M.build.spiffs_blocksize=8192
coredev.menu.FlashSize.2M.upload.maximum_size=1044464

